Ext.define('ERPPermissionStatic', {

	statics: {
		//人资模块*************************************************
	    HR_MANAGE : 'AM-00000-000',//人资管理
	    	HR_COMPANY : 'AM-01000-000',//公司管理
	    	HR_CARD : 'AM-02000-000',//卡号管理
	    	HR_ATT : 'AM-03000-000',//考勤管理
	    		HR_ATT_CONFIG : 'AM_03100-000',//常规设置
	    		HR_ATT_HOLIDAY : 'AM-03200-000',//假日维护
	    		HR_ATT_SHIFT_TIME : 'AM-03300-000',//时段维护
	    		HR_ATT_SHIFT : 'AM-03400-000',//班次管理
	    		HR_ATT_EMP_SHIFT : 'AM-03500-000',//员工排班
	    		HR_ATT_MONTH : 'AM-03600-000',//考勤汇总
	    		HR_ATT_CHECK : 'AM-03700-000',//打卡明细
	    	HR_CONTRACT : 'AM-04000-000',//劳动合同
	    	HR_LEAVE_TYPE : 'AM-05000-000',//请假类型
	    	HR_CLOCK : 'AM-06000-000',//设备管理
	    		HR_CLOCK_CLOCK_LIST : 'AM-06100-000',//设备列表
	    			HR_CLOCK_CLOCK_LIST_ADD : 'AB-06100-001',//新增
	    			HR_CLOCK_CLOCK_LIST_UPDATE : 'AB-06100-002',//修改
	    			HR_CLOCK_CLOCK_LIST_DELETE : 'AB-06100-003',//删除
	    		HR_CLOCK_FINGER :'AM-06200-000',//员工指纹
	    		HR_CLOCK_FACE : 'AM-06300-000',//员工人脸
		//数据管理模块**********************************************
		DA_MANAGE : 'SM-00000-000',//数据管理
			DA_EMP : 'SM-01000-000',//职员管理
			DA_DEP : 'SM-02000-000',//数据管理
			DA_ROLE : 'SM-03000-000',//角色管理
			DA_PERMISSION : 'SM-04000-000',//授权管理
		//系统管理模块**********************************************
		SY_MANAGE : 'SM-10000-000',//系统管理
			SY_FUN : 'SM-11000-000',//功能管理
		//流程管理模块**********************************************
		FW_MANAGE : 'SM-20000-000',//流程管理
			FW_DEFINED : 'SM-21000-000',//流程定义
		//营销模块*************************************************
		MA_MANAGE : 'AM-20000-000',//营销管理
			MA_CUSTOMER : 'AM-21000-000',//客户管理
				MA_CUSTOMER_ADD : 'AB-21000-001',//客户报备
				MA_CUSTOMER_UPDATE : 'AB-21000-002',//补录修改
		//财务模块*************************************************
		//运营模块*************************************************
	}
	
});